@extends('blog.layout.master')
@section('title','列表页')
@section('content')

<div class="col-sm-8 blog-main">

    <div class="blog-post">
        <h2 class="blog-post-title">用户访问数据是否影响搜索排名？</h2>
        <p class="blog-post-meta">发表于 2017年03月16日 by <a href="./user.html">Mark</a></p>

        <div class="entry-content">
            <p>用户访问数据是否影响页面的搜索排名？这是个老话题。早在11年前，我就在SEO每天一贴写过<a href="https://www.seozac.com/google/google-traffic-pattern/">Google可能在排名算法中考虑用户行为方式</a>。</p><p>不过，到目前为止，所有就这个问题发过言的Google工程师都明确否认用户访问和行为数据是排名的直接因素。这里要注意他们的用词，通常他们否认的是 &ndash; 直接因素。而我们SEO观察到的情况是，用户访问和行为至少会间接影响页面排名。</p><p>在搜索过程中，主要的用户访问、交互行为包括点击率、跳出率、用户停留时间、访问深度等，广义点看，还包括了在<a href="https://www.seozac.com/social/ranking-signal/">社交媒体上的分享、评论等行为对SEO的影响</a>。</p><h2>点击率是否影响页面排名？</h2><p>首先，搜索结果中页面的点击率肯定是影响排名的，不然就没有前几年的百度点击器和现在的所谓百度快排了。Google也同样，虽然公开场合都否认是直接因素，但数年前就有Google工程师当面和我说过，点击率是会影响排名的。也许不是直接排名因素，但可以是校验因素。</p><p>去年底，<a href="https://www.searchenginejournal.com/6-seo-experiments-will-blow-mind/181084/" target="_blank">Larry Kim的统计</a>表明：</p><ul><li>排名靠前的页面点击率有越来越高的趋势，从2016年4月的22%上升到9月的24%</li><li>超过所在位置平均点击率的页面容易获得1-4位的排名，比如超过平均点击率20%的页面容易被排到第一位</li><li>比平均点击率低的页面一般排在6-10位</li></ul><p>关于所在位置平均点击率是指，每个排名位置，有个大致稳定的点击率，比如第一位，通常点击率30-40%等等，如下图：</p><p><img class="size-full wp-image-3189 alignnone" src="https://www.seozac.com/wp-content/uploads/2017/03/click-distribution-serp.jpg" alt="搜索结果页面点击率分布" srcset="https://www.seozac.com/wp-content/uploads/2017/03/click-distribution-serp.jpg 451w, https://www.seozac.com/wp-content/uploads/2017/03/click-distribution-serp-300x279.jpg 300w" sizes="(max-width: 451px) 100vw, 451px" height="420" width="451"></p><p>还不明白的，请参考<a href="https://www.seozac.com/seobook/">《SEO实战密码》</a>第2章，第6小节，用户怎样浏览搜索结果页面部分。</p><p>当然，搜索引擎要找到办法剔除用户数据中的噪声、作弊，并考虑到不同场景下的特殊性，不然，点击器或快排之类的就会大行其道。就我所知，有不少人试过把百度点击器的同样方法用在Google排名上，但没有看到明显效果，Google的反作弊能力高一些。现在Google算法中很可能加强了点击率等用户数据的影响，不知道有没有人在继续实验Google点击器？</p><h2>修改页面标题就能提高页面排名？</h2><p>那么问题来了，如果页面有了一定的排名，比如爬到了第一页下半部分，是不是修改一下页面标题，更吸引眼球，更吸引人点击，就能进一步提高页面的排名？</p><p>答案是，经常是会有效的。不知道有几个读者注意到，近几个月，我在这个博客的一组页面上，大量、频繁更改、实验页面标题，并观察记录排名变化，我的结论是，用个更好的标题，点击率提高，确实能提高排名。</p><p>而且我发现，百度会从同一个网站上挑选几个相似页面，目标关键词几乎相同，轮换给予排名，看哪个效果更好。百度经过一段时间的数据积累，点击率高的，保持排名，点击率低的，页面可能会跑到很后面去。</p><p>再进一步，是不是我的页面是<a href="https://www.seozac.com/">关于SEO</a>的，在标题上写”免费、高清、无码苍老师作品+SEO“就能排名巨牛了？显然，也没这种好事。</p><h2>跳出率和停留时间是否影响排名？</h2><p>吸引到点击以后怎么办？用户是否真的愉快地看到了苍老师，搜索引擎也是会评估的。</p><p>Larry Kim的统计还表明：</p><ul><li>跳出率在76%以下的页面更可能排名在1-4位，跳出率78%以上的，更可能出现在5-10位。</li><li>用户在网站的停留时间长的更可能排在1-6位，他的数据是长达8分钟多，这个有点长。停留时间短的就从第7往后排了。</li></ul><p>当然，搜索引擎一定会注意到应用场景，上面的统计数字并不是绝对的。一个博客，忠实读者来了就是看最新文章，然后就走了，越忠实，可能跳出率越高。一个论坛就不能是这样。一个查询汇率页面，用户来了，瞟一眼就知道答案了，跳出率高、停留时间短，但不说明用户不满意。</p><p>这个我也做了实验。怎么提高停留时间呢？最简单的方法是，把页面弄长点呗。我把两个页面内容扩充了很多，用户从这两个页面进入时的停留时间加长了。页面在百度的排名跳动一段时间后，爬到比以前高得多的位置。但这个几乎是孤证，不能说是结论，只能当个参考。</p><p>（注：我这只是做个实验，举个例子。真正提高停留时间、访问深度的方法是改善用户体验，不是把页面弄长点这么简单。）</p><p>所以，建议SEO们查看一下百度站长平台、Google站长工具、流量统计，找出用户访问数据难看的页面，看看能不能优化一下，也许有意想不到的效果。</p><h2>搜索引擎怎样获得用户访问数据？</h2><p>有些数据搜索引擎从结果页面就能得到，比如点击率。</p><p>有些可能需要借助其它服务，比如百度和Google都有自己的流量统计服务，而且是最流行的流量统计服务。但是，搜索引擎，包括百度和Google，都声明，他们的排名算法中不会使用自己的网站统计服务或浏览器数据。前几天，<a href="https://www.stonetemple.com/google-chrome-discover-pages" target="_blank">Eric Enge的实验</a>表明，Google不会利用Chrome用户访问数据发现新URL。</p><p>而且，很多网站完全不使用百度统计、Google Analytics这类的服务，那么，如果我们观察和统计的数据都表明，用户体验、交互等访问行为影响了搜索排名，搜索引擎从哪里获得这些用户访问数据？这可能就会牵扯到下一篇帖子的主题：人工智能将彻底改变SEO。</p>
        </div>
    </div><!-- /.blog-post -->

</div><!-- /.blog-main -->

@include('blog.block.sider')

@endsection